import {
  LeftBlock,
  Line,
  Paragraph,
  RightBlock,
  Title,
  Wrapper,
} from "./AboutUs.styled";
import aboutus from "../../assets/images/about1.jpg";

const AboutUs = () => {
  return (
    <>
      <Line></Line>
      <Wrapper>
        <LeftBlock>
          <img src={aboutus} alt="" />
        </LeftBlock>
        <RightBlock>
          <Title>Про нас</Title>
          <Paragraph>
            Ми - команда розробників, яка присвячена творчому процесу та
            безперервному вдосконаленню. Наша історія розпочалася кілька років
            тому, коли ми зібралися разом для реалізації спільного проекту, і з
            тих пір ми не припиняємо піднімати планку в галузі розробки
            програмного забезпечення та завжди прагнемо до найкращих стандартів
            у нашій роботі.{" "}
          </Paragraph>
          <Paragraph>
            {" "}
            Ми спеціалізуємось на різних технологіях і мовах програмування, що
            дає нам можливість створювати інноваційні продукти для наших
            клієнтів. Один із наших основних принципів - це навчання і розвиток.
            Ми віримо, що навчання - це ключ до досягнення успіху в цій галузі.
          </Paragraph>
          <Paragraph>
            Ми відкриті для співпраці та обміну ідеями та завжди раді взяти на
            себе нові виклики і розглядати це як можливість для зростання і
            вдосконалення. Відзначаючи наші успіхи, ми завжди пам&apos;ятаємо,
            що наша команда - це результат спільних зусиль і відданості нашій
            справі.
          </Paragraph>

          <Paragraph>
            Наша мета - робити світ програмування кращим і більш доступним для
            всіх.
          </Paragraph>
        </RightBlock>
      </Wrapper>
      <Line></Line>
    </>
  );
};

export default AboutUs;
